#### OpenTofu Plan `failure`

<details><summary>Show Plan</summary>

```

tofu
Acquiring state lock. This may take a few moments...
data.github_user.davidtabat: Reading...
github_team.teams["tech-lead"]: Refreshing state... [id=11884044]
github_membership.users["davidtabat"]: Refreshing state... [id=test-opentofu-mageos:davidtabat]
github_team.teams["distribution"]: Refreshing state... [id=11884012]
github_team.teams["continuous-integration"]: Refreshing state... [id=11884011]
github_team.teams["async-events"]: Refreshing state... [id=11884010]
github_team.teams["infrastructure"]: Refreshing state... [id=11884045]
github_team.teams["content"]: Refreshing state... [id=11884013]
github_repository.repositories["mageos-magento-zend-pdf"]: Refreshing state... [id=mageos-magento-zend-pdf]
github_repository.repositories["mageos-magento-composer-installer"]: Refreshing state... [id=mageos-magento-composer-installer]
github_repository.repositories["mageos-PHPCompatibilityFork"]: Refreshing state... [id=mageos-PHPCompatibilityFork]
github_repository.repositories["meta"]: Refreshing state... [id=meta]
github_repository.repositories["mageos-commerce-data-export"]: Refreshing state... [id=mageos-commerce-data-export]
github_repository.repositories["mageos-security-package"]: Refreshing state... [id=mageos-security-package]
github_repository.repositories["mageos-async-events-azure"]: Refreshing state... [id=mageos-async-events-azure]
github_repository.repositories["mageos-composer-root-update-plugin"]: Refreshing state... [id=mageos-composer-root-update-plugin]
github_repository.repositories["mageos-magento-zend-loader"]: Refreshing state... [id=mageos-magento-zend-loader]
github_repository.repositories["mageos-inventory"]: Refreshing state... [id=mageos-inventory]
github_repository.repositories["mageos-adobe-stock-integration"]: Refreshing state... [id=mageos-adobe-stock-integration]
data.github_user.davidtabat: Read complete after 4s [id=79899333]
github_repository.repositories["infrastructure"]: Refreshing state... [id=infrastructure]
github_repository.repositories["mageos-magento2"]: Refreshing state... [id=mageos-magento2]
github_repository.repositories["github-actions"]: Refreshing state... [id=github-actions]
github_repository.repositories["mageos-magento2-page-builder"]: Refreshing state... [id=mageos-magento2-page-builder]
github_repository.repositories["mageos-composer-dependency-version-audit-plugin"]: Refreshing state... [id=mageos-composer-dependency-version-audit-plugin]
github_repository.repositories["dev-env-gitpod"]: Refreshing state... [id=dev-env-gitpod]
github_repository.repositories["mageos-magento2-sample-data"]: Refreshing state... [id=mageos-magento2-sample-data]
github_repository.repositories["namespace"]: Refreshing state... [id=namespace]
github_repository.repositories["mageos-composer"]: Refreshing state... [id=mageos-composer]
github_repository.repositories["mageos-async-events-aws"]: Refreshing state... [id=mageos-async-events-aws]
github_repository.repositories["devdocs"]: Refreshing state... [id=devdocs]
github_repository.repositories["mage-os-website"]: Refreshing state... [id=mage-os-website]
github_repository.repositories["mageos-async-events-gcp"]: Refreshing state... [id=mageos-async-events-gcp]
github_repository.repositories["mageos-magento-coding-standard"]: Refreshing state... [id=mageos-magento-coding-standard]
github_repository.repositories["mageos-magento2-functional-testing-framework"]: Refreshing state... [id=mageos-magento2-functional-testing-framework]
github_repository.repositories["mageos-async-events-sinks"]: Refreshing state... [id=mageos-async-events-sinks]
github_repository.repositories["mageos-magento-zend-log"]: Refreshing state... [id=mageos-magento-zend-log]
github_repository.repositories["mageos-magento-zend-db"]: Refreshing state... [id=mageos-magento-zend-db]
github_repository.repositories["mageos-magento-zend-exception"]: Refreshing state... [id=mageos-magento-zend-exception]
github_repository.repositories["mageos-async-events"]: Refreshing state... [id=mageos-async-events]
github_repository.repositories["devdocs-website"]: Refreshing state... [id=devdocs-website]
github_repository.repositories["mageos-common-async-events"]: Refreshing state... [id=mageos-common-async-events]
github_repository.repositories["generate-mirror-repo-js"]: Refreshing state... [id=generate-mirror-repo-js]
github_repository.repositories["mageos-async-events-admin-ui"]: Refreshing state... [id=mageos-async-events-admin-ui]
github_repository.repositories["opentofu"]: Refreshing state... [id=opentofu]
github_repository.repositories["mageos-inventory-composer-installer"]: Refreshing state... [id=mageos-inventory-composer-installer]
github_repository.repositories["mageos-magento-zend-memory"]: Refreshing state... [id=mageos-magento-zend-memory]
github_repository.repositories["mageos-magento-zend-cache"]: Refreshing state... [id=mageos-magento-zend-cache]
github_repository.repositories["magento-gitpod"]: Refreshing state... [id=magento-gitpod]
github_repository.mirrors["mirror-magento-zend-db"]: Refreshing state... [id=mirror-magento-zend-db]
github_repository.mirrors["mirror-magento2"]: Refreshing state... [id=mirror-magento2]
github_repository.mirrors["mirror-magento-zend-loader"]: Refreshing state... [id=mirror-magento-zend-loader]
github_repository.mirrors["mirror-page-builder-types"]: Refreshing state... [id=mirror-page-builder-types]
github_repository.mirrors["mirror-quality-patches"]: Refreshing state... [id=mirror-quality-patches]
github_repository.mirrors["mirror-adobe-stock-integration"]: Refreshing state... [id=mirror-adobe-stock-integration]
github_repository.mirrors["mirror-magento-zend-cache"]: Refreshing state... [id=mirror-magento-zend-cache]
github_repository.mirrors["mirror-commerce-data-export"]: Refreshing state... [id=mirror-commerce-data-export]
github_repository.mirrors["mirror-magento-cloud-patches"]: Refreshing state... [id=mirror-magento-cloud-patches]
github_repository.mirrors["mirror-magento2-page-builder"]: Refreshing state... [id=mirror-magento2-page-builder]
github_repository.mirrors["mirror-inventory-composer-installer"]: Refreshing state... [id=mirror-inventory-composer-installer]
github_repository.mirrors["mirror-commerce-admin.en"]: Refreshing state... [id=mirror-commerce-admin.en]
github_repository.mirrors["mirror-magento-coding-standard"]: Refreshing state... [id=mirror-magento-coding-standard]
github_repository.mirrors["mirror-security-package"]: Refreshing state... [id=mirror-security-package]
github_repository.mirrors["mirror-data-migration-tool"]: Refreshing state... [id=mirror-data-migration-tool]
github_repository.mirrors["mirror-composer-dependency-version-audit-plugin"]: Refreshing state... [id=mirror-composer-dependency-version-audit-plugin]
github_repository.mirrors["mirror-magento-zend-log"]: Refreshing state... [id=mirror-magento-zend-log]
github_repository.mirrors["mirror-inventory"]: Refreshing state... [id=mirror-inventory]
github_repository.mirrors["mirror-composer-root-update-plugin"]: Refreshing state... [id=mirror-composer-root-update-plugin]
github_repository.mirrors["mirror-magento2-sample-data"]: Refreshing state... [id=mirror-magento2-sample-data]
github_repository.mirrors["mirror-magento-zend-pdf"]: Refreshing state... [id=mirror-magento-zend-pdf]
github_repository.mirrors["mirror-module-configurable-sample-data-venia"]: Refreshing state... [id=mirror-module-configurable-sample-data-venia]
github_repository.mirrors["mirror-magento2-functional-testing-framework"]: Refreshing state... [id=mirror-magento2-functional-testing-framework]
github_repository.mirrors["mirror-magento-composer-installer"]: Refreshing state... [id=mirror-magento-composer-installer]
github_repository.mirrors["mirror-PHPCompatibilityFork"]: Refreshing state... [id=mirror-PHPCompatibilityFork]
github_repository.mirrors["mirror-commerce-operations.en"]: Refreshing state... [id=mirror-commerce-operations.en]
github_repository.mirrors["mirror-devdocs"]: Refreshing state... [id=mirror-devdocs]
github_repository.mirrors["mirror-adobe-ims"]: Refreshing state... [id=mirror-adobe-ims]
github_repository.mirrors["mirror-magento-zend-exception"]: Refreshing state... [id=mirror-magento-zend-exception]
github_repository.mirrors["mirror-zf1"]: Refreshing state... [id=mirror-zf1]
github_repository.mirrors["mirror-composer"]: Refreshing state... [id=mirror-composer]
github_repository.mirrors["mirror-magento-zend-memory"]: Refreshing state... [id=mirror-magento-zend-memory]
github_team_membership.members["davidtabat_async-events"]: Refreshing state... [id=11884010:davidtabat]
github_team_membership.members["davidtabat_content"]: Refreshing state... [id=11884013:davidtabat]
github_team_membership.members["davidtabat_continuous-integration"]: Refreshing state... [id=11884011:davidtabat]
github_team_membership.members["davidtabat_distribution"]: Refreshing state... [id=11884012:davidtabat]
github_team_membership.members["davidtabat_infrastructure"]: Refreshing state... [id=11884045:davidtabat]
github_team_membership.members["davidtabat_tech-lead"]: Refreshing state... [id=11884044:davidtabat]
github_branch_protection.mirrors["mirror-magento-coding-standard"]: Refreshing state... [id=BPR_kwDONoPJjM4DfBlz]
github_branch_protection.mirrors["mirror-security-package"]: Refreshing state... [id=BPR_kwDONoPHeM4DfBlv]
github_branch_protection.mirrors["mirror-inventory"]: Refreshing state... [id=BPR_kwDONoPPf84DfBmE]
github_branch_protection.mirrors["mirror-magento2"]: Refreshing state... [id=BPR_kwDONoPHdc4DfBl4]
github_branch_protection.mirrors["mirror-adobe-stock-integration"]: Refreshing state... [id=BPR_kwDONoPKb84DfBmD]
github_branch_protection.mirrors["mirror-commerce-data-export"]: Refreshing state... [id=BPR_kwDONoPKLc4DfBl0]
github_branch_protection.mirrors["mirror-magento-zend-memory"]: Refreshing state... [id=BPR_kwDONoPPQc4DfBlq]
github_branch_protection.mirrors["mirror-data-migration-tool"]: Refreshing state... [id=BPR_kwDONoPJ_M4DfBmA]
github_branch_protection.mirrors["mirror-magento2-functional-testing-framework"]: Refreshing state... [id=BPR_kwDONoPL5s4DfBl-]
github_branch_protection.mirrors["mirror-magento2-page-builder"]: Refreshing state... [id=BPR_kwDONoPLSM4DfBl6]
github_branch_protection.mirrors["mirror-PHPCompatibilityFork"]: Refreshing state... [id=BPR_kwDONoPLP84DfBlw]
github_branch_protection.mirrors["mirror-commerce-operations.en"]: Refreshing state... [id=BPR_kwDONoPJqs4DfBlt]
github_branch_protection.mirrors["mirror-module-configurable-sample-data-venia"]: Refreshing state... [id=BPR_kwDONoPM0M4DfBl3]
github_branch_protection.mirrors["mirror-magento-zend-log"]: Refreshing state... [id=BPR_kwDONoPJ184DfBlo]
github_branch_protection.mirrors["mirror-magento-cloud-patches"]: Refreshing state... [id=BPR_kwDONoPKkc4DfBl_]
github_branch_protection.mirrors["mirror-magento-zend-db"]: Refreshing state... [id=BPR_kwDONoPMD84DfBl5]
github_branch_protection.mirrors["mirror-inventory-composer-installer"]: Refreshing state... [id=BPR_kwDONoPHbM4DfBly]
github_branch_protection.mirrors["mirror-magento2-sample-data"]: Refreshing state... [id=BPR_kwDONoPMvs4DfBlx]
github_branch_protection.mirrors["mirror-adobe-ims"]: Refreshing state... [id=BPR_kwDONoPIy84DfBmG]
github_branch_protection.mirrors["mirror-composer-dependency-version-audit-plugin"]: Refreshing state... [id=BPR_kwDONoPOn84DfBlp]
github_branch_protection.mirrors["mirror-magento-zend-pdf"]: Refreshing state... [id=BPR_kwDONoPMKs4DfBl1]
github_branch_protection.mirrors["mirror-page-builder-types"]: Refreshing state... [id=BPR_kwDONoPI_s4DfBll]
github_branch_protection.mirrors["mirror-magento-zend-exception"]: Refreshing state... [id=BPR_kwDONoPPaM4DfBln]
github_branch_protection.mirrors["mirror-zf1"]: Refreshing state... [id=BPR_kwDONoPLLs4DfBl7]
github_branch_protection.mirrors["mirror-magento-zend-cache"]: Refreshing state... [id=BPR_kwDONoPMYs4DfBl8]
github_branch_protection.mirrors["mirror-commerce-admin.en"]: Refreshing state... [id=BPR_kwDONoPMas4DfBls]
github_branch_protection.mirrors["mirror-magento-zend-loader"]: Refreshing state... [id=BPR_kwDONoPL2c4DfBlu]
github_branch_protection.mirrors["mirror-composer-root-update-plugin"]: Refreshing state... [id=BPR_kwDONoPK584DfBmC]
github_branch_protection.mirrors["mirror-quality-patches"]: Refreshing state... [id=BPR_kwDONoPLTs4DfBlj]
github_branch_protection.mirrors["mirror-devdocs"]: Refreshing state... [id=BPR_kwDONoPJWM4DfBl9]
github_branch_protection.mirrors["mirror-magento-composer-installer"]: Refreshing state... [id=BPR_kwDONoPLyc4DfBlk]
github_branch_protection.mirrors["mirror-composer"]: Refreshing state... [id=BPR_kwDONoPJ584DfBlr]

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

OpenTofu planned the following actions, but then encountered a problem:

  # github_repository.repositories["opentofu"] will be destroyed
  # (because key ["opentofu"] is not in for_each map)
  - resource "github_repository" "repositories" {
      - allow_auto_merge            = false -> null
      - allow_merge_commit          = true -> null
      - allow_rebase_merge          = true -> null
      - allow_squash_merge          = true -> null
      - allow_update_branch         = false -> null
      - archived                    = false -> null
      - auto_init                   = true -> null
      - default_branch              = "main" -> null
      - delete_branch_on_merge      = true -> null
      - description                 = "OpenTofu files for managing the organization repository permissions." -> null
      - etag                        = "W/\"020bdd03810f834e956308b3ec2c9e63b1c3051bb4a7f5415e96050b7a8fdaa9\"" -> null
      - full_name                   = "test-opentofu-mageos/opentofu-rename" -> null
      - git_clone_url               = "git://github.com/test-opentofu-mageos/opentofu-rename.git" -> null
      - has_discussions             = false -> null
      - has_downloads               = false -> null
      - has_issues                  = true -> null
      - has_projects                = true -> null
      - has_wiki                    = false -> null
      - html_url                    = "https://github.com/test-opentofu-mageos/opentofu-rename" -> null
      - http_clone_url              = "https://github.com/test-opentofu-mageos/opentofu-rename.git" -> null
      - id                          = "opentofu" -> null
      - is_template                 = false -> null
      - merge_commit_message        = "PR_TITLE" -> null
      - merge_commit_title          = "MERGE_MESSAGE" -> null
      - name                        = "opentofu" -> null
      - node_id                     = "R_kgDONoPKCw" -> null
      - primary_language            = "HCL" -> null
      - private                     = false -> null
      - repo_id                     = 914606603 -> null
      - squash_merge_commit_message = "COMMIT_MESSAGES" -> null
      - squash_merge_commit_title   = "COMMIT_OR_PR_TITLE" -> null
      - ssh_clone_url               = "git@github.com:test-opentofu-mageos/opentofu-rename.git" -> null
      - svn_url                     = "https://github.com/test-opentofu-mageos/opentofu-rename" -> null
      - topics                      = [
          - "adobecommerce",
          - "ecommerce",
          - "mage-os",
          - "magento",
          - "magento2",
        ] -> null
      - visibility                  = "public" -> null
      - vulnerability_alerts        = false -> null
      - web_commit_signoff_required = false -> null

      - security_and_analysis {
          - secret_scanning {
              - status = "disabled" -> null
            }
          - secret_scanning_push_protection {
              - status = "disabled" -> null
            }
        }
    }

  # github_repository.repositories["opentofu-rename"] will be created
  + resource "github_repository" "repositories" {
      + allow_auto_merge            = false
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + archived                    = false
      + auto_init                   = true
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + description                 = "OpenTofu files for managing the organization repository permissions."
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_issues                  = true
      + has_projects                = true
      + has_wiki                    = false
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "opentofu-rename"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = [
          + "adobecommerce",
          + "ecommerce",
          + "mage-os",
          + "magento",
          + "magento2",
        ]
      + visibility                  = (known after apply)
      + web_commit_signoff_required = false

      + security_and_analysis (known after apply)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

```

</details>

Issuer: @davidtabat, Action: https://github.com/test-opentofu-mageos/opentofu-rename/actions/runs/12763147296